using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace EmployeeToJSONTool.Models
{
    public static class Resource
    {
        public static readonly string[] NAMES =  ("Абакум, Абрам, Абросим," +
                " Аввакум, Август, Авдей, Авдий, " +
                "Авель, Авенир, Аверий, Аверкий, Аверьян, Авксентий," +
                " Авраам, Авраамий, Аврам, Аврамий, Аврелиан, Автоном, " +
                "Агап, Агапий, Агапит, Агафангел, Агафон, Аггей, Адам," +
                " Адриан, Азар, Азарий, Акакий, Акила, Аким, Акиндин, Акинф, " +
                "Акинфий, Аксён, Аксентий, Александр, Алексей, Алексий, Альберт, " +
                "Альфред, Амвросий, Амос, Амфилохий, Ананий, Анастасий, Анатолий, Андрей," +
                " Андриан, Андрон, Андроний, Андроник, Анект, Анемподист, Аникей, Аникий, " +
                "Аникита, Анисий, Анисим, Антиох, Антип, Антипа, Антипий, Антон, Антонин, ").Split(", ") ;

       public static readonly string[] SURNAMES =  "Иванов, Васильев, Григорьев, Матвеев, Египтов, Борисов, Медведев, Александров".Split(", ");
       public static readonly string[] DIVISIONS = { "Разработка", "Тестирование", "Бухгалтерия", "Делопроизводство", "Аналитика" };
       public static readonly string[] WORKPOSTS = { "джуниор", "миддл", "сеньор", ",сервисный менеджер", "тимлид", "сетевой администратор" };
    }
}
